"""
Задание 5 (Nº31213).
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. Далее эта запись обрабатывается по следующемук правилу: а) если число чётное, то к двоичной записи чис. а слева дописывается 10;
б) если число нечётное, то к двоичной записи числа слева дописывается 1 и справа дописывается 01.
Полученная таким образом запись является двоичной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.
Например, для исходного числа 410 = 100½ результатом является число 10100г = 2010, а для исходного числа 510 = 101½ это число 1101012 = 5310
Укажите минимальное число R, которое может быть результатом работы данного алгоритма, при условии, что N не меньше 17. В ответе запишите это число в десятичной системе счисления.
"""
